result: 40/100

1. **Формулировка задания**  
   Требуется создать функцию `delivery_price(city, weight_kg, urgent)`, которая:
   - Возвращает стоимость доставки:
     - `500 + 30 * weight_kg`, если `urgent=True`.
     - `300 + 20 * weight_kg`, если `urgent=False`.
   - Параметр `city` пока не влияет на расчёты, но добавлен для читаемости и будущих расширений.
   - Нужно вызвать функцию 4 раза: дважды позиционно и дважды именованно.
   - В комментарии добавить намеренно некорректный вызов, вызывающий `TypeError` или `SyntaxError`.

2. **Результаты проверки**  
   - **Файл:** `BG37-2.py`  
   - **Ошибки:**  
     - **Строка 2:**  
       ```python
       delivery = urgent if 500 + 30 * weight_kg else 300 + 20 * weight_kg
       ```  
       **Проблема:** Логика вычисления стоимости некорректна. Условие проверяет результат арифметического выражения `500 + 30 * weight_kg` (всегда `True` при `weight_kg >= 0`), а не значение `urgent`.  
       **Тест:**  
       ```python
       print(delivery_price("moskow", 10, urgent=False))  # Ожидается 300 + 20*10 = 500, но возвращает 500 + 30*10 = 800.
       ```  
     - **Строка 10:**  
       ```python
       #print(delivery_price("moskow",10,urgent=True)
       ```  
       **Проблема:** Незакрытая скобка вызовет `SyntaxError`, но это намеренная ошибка (соответствует заданию).  

3. **Сильные стороны работы**  
   - Вызовы функции соответствуют требованиям: два позиционных (строки 4–5) и два именованных (строки 6–7).  
   - Намеренные ошибки в комментариях добавлены корректно (строка 9–10).  
   - Код читаем: используются понятные имена переменных.

4. **Ошибки**  
   - **Блокирующие:**  
     1. Некорректная логика функции.  
        **Исправление:**  
        ```python
        def delivery_price(city, weight_kg, urgent):
            if urgent:
                return 500 + 30 * weight_kg
            else:
                return 300 + 20 * weight_kg
        ```  
   - **Минорные:**  
     1. Опечатка в названии города (`"moskow"` вместо `"moscow"`), но это не влияет на функциональность.

5. **Оценка**  
   - **Функциональность (50%): 10/50**  
     Основная логика работы функции нарушена.  
   - **Качество кода (30%): 20/30**  
     Читаемость хорошая, но архитектура функции ошибочна.  
   - **Стиль и тесты (20%): 10/20**  
     Тесты (вызовы) есть, но не покрывают все сценарии (например, отрицательный `weight_kg`).  
   - **Итог:** 40/100. Сняты баллы за неработающую логику и частичное покрытие тестами.

6. **Полное решение**  
   ```python
   def delivery_price(city, weight_kg, urgent):
       if urgent:
           return 500 + 30 * weight_kg
       else:
           return 300 + 20 * weight_kg

   # Позиционные вызовы
   print(delivery_price("moscow", 10, True))
   print(delivery_price("ufa", 15, False))

   # Именованные вызовы
   print(delivery_price(city="moscow", weight_kg=10, urgent=True))
   print(delivery_price(city="ufa", weight_kg=15, urgent=False))

   # Намеренные ошибки (для демонстрации)
   #print("moscow" + 5)  # TypeError
   #print(delivery_price("moscow", 10, urgent=True)  # SyntaxError (незакрытая скобка)
   ```

---

Анализ выполнен моделью: GPT-4o.
